#!/usr/bin/env python
# _*_ coding: UTF-8 _*_
"""=================================================
@Project -> File    : Operate_system_ModeView_structure -> play.py
@IDE     : PyCharm
@Author  : Aimee
@Date    : 2020/5/14 14:42
@Desc    :算术运算符: +(加) -(减) *(乘) /(除) %(余数) //(取整数)
            比较运算符: ==(等于) !=(不等于) >(大于) <(小于) >=(大于等于) <=(小于等于)
            赋值运算符: =
================================================="""
# 18位身份证 1-2 省级 3-4 市级 7-14   17 单数 男 双数 女 18 加密算法

#
if __name__ == '__main__':
    x = input("请输入你的18位身份证号：")
    if len(x) != 18:
        print("你的身份证位数有误")
    else:
        province = x[0: 2]
        sex = x[-2]
        year = x[6: 10]
        month = x[10: 12]
        day = x[12:14]

        province_dic = {
            '11': '北京市', '12': '天津市', '13': '河北省', '14': '山西省', '15': '内蒙古自治区',
            '21': '辽宁省', '22': '吉林省', '23': '黑龙江省', '31': '上海市', '32': '江苏省',
            '33': '浙江省', '34': '安徽省', '35': '福建省', '36': '江西省', '37': '山东省',
            '41': '河南省', '42': '湖北省', '43': '湖南省', '44': '广东省', '45': '广西壮族自治区',
            '46': '海南省', '50': '重庆市', '51': '四川省', '52': '贵州省', '53': '云南省', '54': '西藏自治区',
            '61': '陕西省', '62': '甘肃省', '63': '青海省', '64': '宁夏回族自治区', '65': '新疆维吾尔自治区',
            '71': '台湾省', '81': '香港特别行政区', '82': '澳门特别行政区'
        }

        if int(month) > 12 or int(month) < 1 or int(day) > 31 or int(day) < 1:
            print("你的身份证输入有问题")
        else:
            print("你的身份证属于", province_dic.get(province))
            print("你的出生 {} 年 {} 月 {} 日".format(year, month, day))
            if int(sex) % 2 == 0:
                print("号主性别为 女")
            else:
                print("号主性别为 男")

            born_dic = {0: "鼠", 1: "牛", 2: "虎", 3: "兔", 4: "龙", 5: "蛇", 6: "马", 7: "羊", 8: "猴", 9: "鸡", 10: "狗", 11: "猪"}
            print("你的生肖是 {}".format(born_dic[(int(year) - 1972) % 12]))

            star_dic = ["水瓶座", "双鱼座", "白羊座", "金牛座", "双子座", "巨蟹座", "狮子座", "处女座", "天秤座", "天蝎座", "射手座", "摩羯座"]
            star_day_end = (20, 19, 21, 20, 21, 22, 23, 23, 23, 24, 23, 22)
            month_star = int(month) - 1
            if int(day) > star_day_end[month_star]:
                print("你的星座是 {}".format(star_dic[month_star]))
            else:
                print("你的星座是 {}".format(star_dic[month_star - 1]))

