#!/usr/bin/env python
# _*_ coding: UTF-8 _*_
"""=================================================
@Project -> File    : Operate_system_ModeView_structure -> play1.py
@IDE     : PyCharm
@Author  : Aimee
@Date    : 2020/5/14 18:44
@Desc    :6024, 6031 --> 西藏自治区，不好放
================================================="""


class City:
    def __init__(self):
        beijing_dic = {
            '00': '北京市', '01': '北京市', '02': '北京市', '08': '北京市', '21': '北京市'
        }
        tianjin_dic = {
            '00': '天津市', '01': '天津市', '02': '天津市', '03': '天津市', '05': '天津市', '11': '天津市',
            '17': '天津市', '20': '天津市', '23': '天津市', '59': '天津市'
        }
        hebei_dic = {
            '00': '河北省', '01': '石家庄市', '02': '唐山市', '03': '秦皇岛市', '04': '邯郸市', '05': '邢台市',
            '06': '保定市', '07': '张家口市', '08': '承德市', '09': '沧州市', '10': '廊坊市', '11': '衡水市',
            '21': '邯郸市', '22': '邢台市', '23': '石家庄', '24': '保定市', '25': '张家口', '26': '承德市',
            '28': '廊坊市', '29': '沧州市', '30': '衡水市', '31': '', '38': '', '40': '', '41': '', '42': '',
            '84': '', '90': ''
        }
        shanxi_dic = {
            '01': '太原市', '02': '大同市', '03': '阳泉市', '04': '长治市', '05': '晋城市', '06': '朔州市',
            '07': '晋中市', '08': '运城市', '09': '忻州市', '10': '临汾市', '11': '吕梁市', '20': '',
            '21': '朔州市', '22': '忻州市', '23': '吕梁市', '24': '晋中市', '25': '', '26': '临汾市',
            '27': '运城市', '90': '太原市'
        }
        neimenggu_dic = {
            '01': '呼和浩特市', '02': '包头市', '03': '乌海市', '04': '赤峰市',
            '05': '通辽市', '06': '鄂尔多斯市', '07': '呼伦贝尔市', '08': '巴彦淖尔市',
            '09': '乌兰察布市', '10': '', '12': '', '20': '', '21': '呼伦贝尔是兴安盟乌兰浩特市',
            '23': '通辽市', '24': '', '25': '锡林郭勒盟二连浩特市', '26': '乌兰察布市',
            '27': '鄂尔多斯市', '28': '巴彦淖尔市', '29': '阿拉善盟', '36': '',
            '40': '', '89': ''
        }
        liaoning_dic = {
            '01': '沈阳市', '02': '大连市', '03': '鞍山市', '04': '抚顺市',
            '05': '本溪市', '06': '丹东市', '07': '锦州市', '08': '营口市',
            '09': '阜新市', '10': '辽阳市', '11': '盘锦市', '12': '铁岭市',
            '13': '朝阳市', '14': '葫芦岛市', '22': '朝阳市', '23': '',
            '26': '', '82': '', '90': '铁岭市', '92': ''
        }
        jilin_dic = {
            '01': '长春市', '02': '吉林市', '03': '四平市', '04': '辽源市',
            '05': '通化市', '06': '白山市', '07': '松原市', '08': '白城市',
            '21': '四平市', '22': '', '23': '松原市延边朝鲜族', '24': '自治州',
            '25': '', '30': '', '32': '', '90': '通化市'
        }
        heilongjiang_dic = {
            '00': '黑龙江省', '01': '哈尔滨市', '02': '齐齐哈尔市', '03': '鸡西市',
            '04': '鹤岗市', '05': '双鸭山市', '06': '大庆市', '07': '伊春市',
            '08': '佳木斯市', '09': '七台河市', '10': '牡丹江市', '11': '黑河市',
            '12': '绥化市', '14': '', '19': '', '21': '哈尔滨市', '23': '绥化市',
            '24': '佳木斯市', '26': '黑河市大兴安岭地', '27': '', '32': '',
            '50': '', '90': '伊春市'
        }
        shanghai_dic = {
            '01': '上海市', '02': '奉贤区', '08': '', '10': '', '21': '', '30': '',
            '31': '', '33': '', '70': ''
        }
        jiangsu_dic = {
            '00': '', '01': '南京市', '02': '无锡市', '03': '徐州市', '04': '常州市',
            '05': '苏州市', '06': '南通市', '07': '连云港市', '08': '淮安市',
            '09': '盐城市', '10': '扬州市', '11': '镇江市', '12': '泰州市',
            '13': '宿迁市', '18': '', '21': '', '23': '', '24': '', '26': '', '27': '', '30': '',
            '41': '', '43': '', '60': '', '80': '', '90': ''
        }
        zhejiang_dic = {
            '01': '杭州市', '02': '宁波市', '03': '温州市', '04': '嘉兴市', '05': '湖州市',
            '06': '绍兴市', '07': '金华市', '08': '衡州市', '09': '舟山市', '10': '台州市',
            '11': '丽水市', '20': '', '25': '丽水市', '26': '台州市', '27': '舟山市', '29': '',
            '90': '杭州市'
        }
        anhui_dic = {
            '01': '合肥市', '02': '芜湖市', '03': '蚌埠市', '04': '淮南市', '05': '马鞍山市',
            '06': '淮北市', '07': '铜陵市', '08': '安庆市', '09': '', '10': '黄山市',
            '11': '滁州市', '12': '阜阳市', '13': '宿州市', '14': '巢湖市', '15': '六安市',
            '16': '亳州市', '17': '池州市', '18': '宣城市', '21': '阜阳地区宿县地区',
            '22': '宿州市', '23': '滁州市', '24': '六安市', '25': '宣城地区', '26': '巢湖市',
            '27': '黄山市', '28': '安庆市', '29': '池州市'
        }
        fujian_dic = {
            '01': '福州市', '02': '厦门市', '03': '莆田市', '04': '三明市', '05': '泉州市',
            '06': '漳州市', '07': '南平市', '08': '龙岩市', '09': '宁德市', '20': '',
            '21': '南平市', '22': '宁德市', '25': '', '26': '龙岩市', '32': '', '90': '泉州市'
        }
        jiangxi_dic = {
            '01': '南昌市', '02': '景德镇市', '03': '萍乡市', '04': '九江市', '05': '新余市',
            '06': '鹰潭市', '07': '赣州市', '08': '吉安市', '09': '伊春市', '10': '抚州市',
            '11': '上饶市', '20': '', '21': '赣州市', '22': '宜春市', '23': '上饶市',
            '24': '吉安市', '25': '抚州市', '32': '', '90': ''
        }
        shandong_dic = {
            '01': '济南市', '02': '青岛市', '03': '淄博市', '04': '枣庄市', '05': '东营市',
            '06': '烟台市', '07': '潍坊市', '08': '济宁市', '09': '泰安市', '10': '威海市',
            '11': '日照市', '12': '莱芜市', '13': '临沂市', '29': '菏泽市', '90': '烟台市',
            '95': ''
        }
        henan_dic = {
            '00': '', '01': '郑州市', '02': '开封市', '03': '洛阳市', '04': '平顶山市',
            '05': '安阳市', '06': '鹤壁市', '07': '新乡市', '08': '焦作市', '09': '濮阳市',
            '10': '许昌市', '11': '漯河市', '12': '三门峡市', '13': '南阳市', '14': '商丘市',
            '15': '信阳市', '16': '周口市', '17': '驻马店市', '20': '', '21': '', '22': '',
            '23': '商丘市', '24': '郑州市', '25': '三门峡市', '27': '周口市', '28': '驻马店市',
            '29': '南阳市', '30': '信阳市', '48': '', '90': '新乡市'
        }
        hubei_dic = {
            '00': '', '01': '武汉市', '02': '黄石市', '03': '十堰市', '04': '沙市', '05': '宜昌市',
            '06': '襄樊市', '07': '鄂州市', '08': '荆门市', '09': '孝感市', '10': '荆州市',
            '11': '黄冈市', '12': '咸宁市', '13': '随州市', '14': '', '19': '', '20': '',
            '21': '黄冈市', '22': '孝感市', '23': '咸宁市', '24': '潜江市', '25': '襄樊市',
            '26': '十堰市', '27': '宜昌市恩施土家族', '28': '苗族自治州', '29': '神农架林区',
            '30': '', '33': '', '34': '', '42': '', '43': '', '51': '', '58': '',
            '90': '省直辖县级行政单位仙桃市'
        }
        hunan_dic = {
            '00': '', '01': '长沙市', '02': '株洲市', '03': '湘潭市', '04': '衡阳市', '05': '邵阳市',
            '06': '岳阳市', '07': '常德市', '08': '张家界市', '09': '益阳市', '10': '郴州市',
            '11': '永州市', '12': '怀化市', '13': '娄底市', '20': '', '21': '株洲市',
            '22': '岳阳地区', '23': '益阳市', '24': '常德市', '25': '娄底市', '26': '邵阳市',
            '27': '衡阳市', '28': '郴州市', '29': '永州市', '30': '怀化市湘西土家族',
            '31': '苗族自治州', '52': '', '90': '岳阳市'
        }
        guangdong_dic = {
            '00': '', '01': '广州市', '02': '韶关市', '03': '深圳市', '04': '珠海市',
            '05': '汕头市', '06': '佛山市', '07': '江门市', '08': '湛江市',
            '09': '茂名市', '10': '东莞市', '12': '肇庆市', '13': '惠州市', '14': '梅州市',
            '15': '汕尾市', '16': '河源市', '17': '阳江市', '18': '清远市', '19': '中山市',
            '20': '',  '22': '', '24': '河源市', '25': '韶关市', '26': '中山市',
            '27': '肇庆市', '28': '', '51': '潮州市', '52': '揭阳市', '53': '云浮市',
            '61': '', '62': ''
        }
        guangxizhuangzu_dic = {
            '00': '', '01': '南宁市', '02': '柳州市', '03': '桂林市', '04': '梧州市',
            '05': '北海市', '06': '防城港市', '07': '钦州市', '08': '贵港市',
            '09': '玉林市', '10': '百色市', '11': '贺州市', '12': '河池市',
            '13': '来宾市', '14': '崇左市', '15': '', '21': '南宁市', '22': '柳州市',
            '23': '桂林市', '24': '贺州市', '25': '玉林市', '26': '百色市', '27': '河池市',
            '28': '钦州市'
        }
        hainan_dic = {
            '00': '海口市', '01': '海口市', '02': '三亚市', '03': '三沙市',
            '06': '', '08': '', '10': '', '22': '', '28': '', '90': '省直辖县行政单位五指山市'
        }
        chongqing_dic = {
            '00': '重庆市', '01': '重庆市', '02': '城口县', '03': '合川市',
            '12': '', '15': ''
        }
        sichuan_dic = {
            '00': '', '01': '成都市', '02': '九龙坡', '03': '自贡市', '04': '攀枝花市',
            '05': '泸州市', '06': '德阳市', '07': '绵阳市', '08': '广元市',
            '09': '遂宁市', '10': '内江市', '11': '乐山市', '12': '梁平县',
            '13': '南充市', '14': '眉山市', '15': '宜宾市', '16': '广安市',
            '17': '达州市', '18': '雅安市', '19': '巴中市', '20': '资阳市',
            '22': '开县', '23': '丰都县', '24': '', '25': '宜宾市', '27': '',
            '28': '', '29': '广安市', '30': '达州市', '31': '雅安市',
            '32': '阿坝藏羌族自治州', '33': '甘孜藏族自治州', '34': '凉山彝族自治州',
            '35': '酉阳土家族苗族自治县', '36': '广安市', '37': '巴中市',
            '38': '眉山市', '39': '资阳市', '50': '', '72': '', '87': '',
            '90': '德阳市'
        }
        guizhou_dic = {
            '01': '贵阳市', '02': '六盘水市', '03': '遵义市', '04': '安顺市',
            '05': '毕节市', '06': '铜仁市', '09': '', '21': '遵义市', '22': '铜仁市',
            '23': '黔西南布依族苗族自治州', '24': '毕节市', '25': '安顺市',
            '26': '黔东南苗族侗族自治州', '27': '黔南布依族苗族自治州', '31': '',
            '58': '', '79': ''
        }
        yunnan_dic = {
            '01': '昆明市', '02': '', '03': '曲靖市', '04': '玉溪市',
            '05': '保山市', '06': '邵通市', '07': '丽江市', '08': '普洱市',
            '09': '临沧市', '10': '', '21': '邵通市', '22': '昆明市',
            '23': '楚雄彝族自治州', '24': '玉溪市', '25': '红河哈尼族彝族自治州',
            '26': '文山壮族苗族自治州', '27': '思茅市', '28': '西双版纳傣族自治州',
            '29': '大理白族自治州', '30': '保山市', '31': '德宏傣族景颇族自治州',
            '32': '丽江市', '33': '怒江傈僳族自治州', '34': '迪庆藏族自治州',
            '35': '临沧市'
        }
        xizang_dic = {
            '00': '', '01': '拉萨市', '05': '', '21': '昌都地区', '22': '山南地区',
            '23': '日喀则市', '24': '那曲地区', '25': '阿里地区', '26': '林芝地区',
        }
        shanxi_two_dic = {
            '00': '', '01': '西安市', '02': '铜川市', '03': '宝鸡市', '04': '咸阳市',
            '05': '渭南市', '06': '延安市', '07': '汉中市', '08': '榆林市',
            '09': '安康市', '10': '商洛市', '12': '', '20': '', '21': '渭南市',
            '23': '汉中市', '24': '安康市', '25': '商洛市', '26': '延安市',
            '27': '榆林市', '29': '', '31': '', '62': ''
        }
        gansu_dic = {
            '00': '', '01': '兰州市', '02': '嘉峪关市', '03': '金昌市', '04': '白银市',
            '05': '天水市', '06': '武威市', '07': '张掖市', '08': '平凉市', '09': '酒泉市',
            '10': '庆阳市', '11': '定西市', '12': '陇南市', '13': '', '19': '', '20': '',
            '21': '酒泉市', '22': '张掖市', '23': '武威市', '24': '定西市', '25': '',
            '26': '陇南市', '27': '平凉市', '28': '庆阳市', '29': '临夏回族自治州',
            '30': '甘南藏族自治州', '42': '', '57': '', '58': '', '62': ''
        }
        qinghai_dic = {
            '00': '', '01': '西宁市', '21': '西宁市', '22': '海北藏族自治州',
            '23': '黄南藏族自治州', '24': '', '25': '海南藏族自治州',
            '26': '果洛藏族自治州', '27': '玉树藏族自治州', '28': '海西蒙古族藏族自治州'
        }
        ningxia_dic = {
            '01': '银川市', '02': '石嘴山市', '03': '吴忠市', '04': '固原市',
            '05': '中卫市', '06': '', '11': '', '21': '中卫市', '22': '固原市',
        }
        xinjiang_dic = {
            '01': '乌鲁木齐市', '02': '克拉玛依市', '03': '', '20': '',
            '21': '吐鲁番地区', '22': '哈密地区', '23': '昌吉回族自治州',
            '24': '伊犁哈萨克自治州', '25': '塔城地区', '26': '阿勒泰地区',
            '27': '博尔塔拉蒙古自治州', '28': '巴音郭楞蒙古自治州',
            '29': '阿克苏地区', '30': '克孜勒苏柯尔克孜自治州',
            '31': '喀什地区', '32': '和田地区', '40': '伊犁哈萨克自治州',
            '41': '伊犁哈萨克自治州', '42': '塔城地区', '43': '阿勒泰地区',
            '90': '自治区直辖县级行政单位石河子市', '93': ''
        }
        self.city_dic = {
            '北京市': beijing_dic, '天津市': tianjin_dic, '河北省': hebei_dic, '山西省': shanxi_dic,
            '内蒙古自治区': neimenggu_dic, '辽宁省': liaoning_dic, '吉林省': jilin_dic,
            '黑龙江省': heilongjiang_dic, '上海市': shanghai_dic, '江苏省': jiangsu_dic,
            '浙江省': zhejiang_dic, '安徽省': anhui_dic, '福建省': fujian_dic, '江西省': jiangxi_dic,
            '山东省': shandong_dic, '河南省': henan_dic, '湖北省': hubei_dic, '湖南省': hunan_dic,
            '广东省': guangdong_dic, '广西壮族自治区': guangxizhuangzu_dic, '海南省': hainan_dic,
            '重庆市': chongqing_dic, '四川省': sichuan_dic, '贵州省': guizhou_dic,
            '云南省': yunnan_dic, '西藏自治区': xizang_dic, '陕西省': shanxi_two_dic,
            '甘肃省': gansu_dic, '青海省': qinghai_dic, '宁夏回族自治区': ningxia_dic,
            '新疆维吾尔自治区': xinjiang_dic,
        }

    def get_city_name(self, province_name, city_num):
        return self.city_dic[province_name][city_num]


class Province:
    def __init__(self):
        self.province_dic = {
            '11': '北京市', '12': '天津市', '13': '河北省', '14': '山西省', '15': '内蒙古自治区',
            '21': '辽宁省', '22': '吉林省', '23': '黑龙江省', '31': '上海市', '32': '江苏省',
            '33': '浙江省', '34': '安徽省', '35': '福建省', '36': '江西省', '37': '山东省',
            '41': '河南省', '42': '湖北省', '43': '湖南省', '44': '广东省', '45': '广西壮族自治区',
            '46': '海南省', '50': '重庆市', '51': '四川省', '52': '贵州省', '53': '云南省', '54': '西藏自治区',
            '61': '陕西省', '62': '甘肃省', '63': '青海省', '64': '宁夏回族自治区', '65': '新疆维吾尔自治区',
            '71': '台湾省', '81': '香港特别行政区', '82': '澳门特别行政区', '57': '西藏自治区'
        }

    def get_province_name(self, province_num):
        return self.province_dic[province_num]


if __name__ == '__main__':
    x = input("请输入身份证号：")
    if len(x) != 18:
        print("你的身份证位数有误")
    else:
        myProvince = Province()
        num_pro = x[0:2]
        myprovince_name = myProvince.get_province_name(num_pro)
        num_city = x[2:4]
        myCity = City()
        mycity_name = myCity.get_city_name(myprovince_name, num_city)
        print(myprovince_name)
        print(mycity_name)
